/* eslint-disable max-len */
export const capcutMockV2Data: any[] = [
  {
    text: `富士康为什么突然被查？这对全国120万的富士康员工 有何影响？最近， 富士康在广东、江苏等地被税务稽查。与此同时呢， 自然资源部门 对富士康在河南、湖北等省市的用地 进行现场勘查。别小看这短短的一句话啊， 释放了两个信息， 一、是税务部门调查有没有偷税漏税。二是自然资源部门 调查土地的使用情况。要知道， 当年全国各地为了吸引富士康 使出浑身解数， 不仅帮富士康招人， 还有各种减免税， 甚至有些地方啊， 还给富士康 不能多说了啊， 按理说， 咱们给了富士康这么多优惠政策， 富士康应该感激才是啊！
可谁能想到， 老郭这是吃尽红利 翻脸不认人呐！他居然说这是在给大陆赏饭吃！富士康为啥敢如此傲慢呢？
先来看一组数据， 富士康位居财富世界500强第20位， 在中国企业中 仅次于国家电网、中石油、中石化 以及中国建筑集团。
就连咱们熟知的宇宙第一大行 工商银行啊， 都排在富士康后面。
富士康不仅财大气粗， 还跟全国各地啊深度绑定。
目前 富士康在全国的工厂达到40多个， 总员工数超过了100万。
所以很多人说 不能碰富士康啊， 万一富士康跑了该咋办？
富士康真的是大到不能碰了吗？
并不是。过去40年 我们之所以给富士康各种政策优惠， 不是因为富士康有多强， 而是因为富士康背后的苹果公司呀， 太过强大。
没有苹果的订单， 富士康啊 连一毛钱都不值。
过去我们扶持富士康， 那是希望打入苹果供应 链，希望苹果的零部件啊， 可以在中国生产， 在中国组装， 最后出口到全世界， 构建起一条啊 完整的电子信息产业链。
可谁能想到， 从2019年开始， 苹果供应链开始大规模的去中国化， 中国大陆的供应占比 从巅峰时期的26%下降到如今的2.5%。
按照苹果的如意算盘， 要想完成去中国化， 第一步呀， 就是先在越南和印度 建设一两座富士康工厂。
第二步呢， 就是把中国供应商一点点踢出去， 换成海外的供应商。
第三步，逐渐增加越南、 印度这些海外供应商的订单。
第四步，也是最后的一步， 就是把中国大陆的富士康啊， 全部迁出去， 彻底完成去中国化。
如今的苹果已经走完第二步了， 马上就要进行第三步了。
可让他万万没想到的是， 华为啊，居然在今年9月起死回生了。
华为的崛起 彻底打乱了苹果去中国化的节奏。
还记得今年国庆黄金周吗？
华为上市仅仅一个月啊， 就把苹果在中国的市场份额 干到只剩17.4%。
吓得哭客呀， 赶紧来中国亲自下场带货！
顾客为啥荒凉？
如今的中国是苹果全球第一大市场， 也是苹果全球最大的食物来源。
吃着中国人的饭， 砸着中国人的碗， 只想在中国赚钱， 不想为中国做贡献。
不仅不做贡献啊， 还一门心思向外转移产链， 这样的企业以及背后的代工厂， 你说凭啥还要给他特殊优待呢？
现在你明白 国家为啥要坚定支持华为了吗？
支持华为，就是在支持中国产业链， 只有华为链才能对抗苹果链。
华为链呀， 就是中国链。关注4G实务分析，收。
`
  },
  {
    text: `俄罗斯这个国家 真的是个非常神奇的存在啊， 说到政治军事， 没有人敢小瞧他， 他拥有全世界最大的国土面积 和最多的核弹头。
但是同时呢， 一提到经济啊， 那似乎就没有俄罗斯什么事了。
你看这俄罗斯哈， 在短短的半个世纪里面 就经历了什么政治动荡啊、 恶性通胀、 寡头黑帮、 高速发展、 战争、政府违约、 经济危机、 激进的改革等等等等。
所以今天呢， 小林就来给大家一起梳理一下啊 这个错综复杂而又独一无二的 俄罗斯的经济。
它到底是怎么回事？
我先声明一下啊， 一个国家的经济 确实是太错综复杂了， 所以呢，我只能挑我觉得比较重要 又有意思的地方来跟大家分享一下， 但是我觉得 重点应该基本上也都是重点。
大家如果有什么自己的观点 或者想法， 也欢迎在评论区留言讨论。
但是哈，咱话说好了， 留言区我们好好说话， 别动不动就打起来。
还有就是最后啊， 我会有一个对俄罗斯经济的 一个简要 橄榄， 你要是也不感兴趣，都发生了什么， 就想看那个最经典的橄榄， 你可以直接划到最后， 但是我还是非常建议哈， 把前面这些东西都看一看， 毕竟能像小林这种 把这些复杂的东西又讲的清楚直白 又很有意思的人， 在这个世界上也不多了啊！
你也可以点个赞表示一下。
说到俄罗斯经济啊， 咱必须得从前苏联说起。
所以这块呢， 我就一丢丢带到历史， 帮大家刷新一下记忆。
沙俄爆发民主革命， 迫使沙皇退位。
之后，以 列宁为首的社会民主工党 推翻了临时政府。
经过了5年的内战， 1922年苏联诞生。
两年之后， 1924年这个人上台， 成为了前苏联的最高领导人， 他就是约瑟夫维萨里亚的诺维奇 斯大林。从此啊， 苏联就真正的开始 全面推行计划经济。
计划经济哈， 就是说所有的经济资源 从分配、生产 甚至到一部分的消费 都是按照计划走。
就比如说哈， 这点物资急缺了， 上面只要一指命令，哗， 所有的物资就都调过来。
再比如说哈， 我们现在要开始发展重工业， 需要大家一起来建工厂， 然后上面一指命令， 这工人全就都过去， 他也不需要时间 等市场经济进行自我调节。
其实这种模式哈， 在你方向非常明确 或者 要进行整体的大规模改革的情况下 是非常高效的。
而当时的苏联呢， 就处于工业化和现代化 都严重不足的情况， 他就非常适合计划经济。
于是1928年之后， 斯大林的前三个五年计划， 那可谓是效果拔群， 前苏联就迅速摇身一变， 从一个落后的农业国家 变成了一个工业大国。
你看啊， 这使前苏联的人均GDP从20年到40年 翻了三倍多。
而你想啊， 那时候1929年的美国 正在经历着大萧条， 整个西方哈都跟着遭殃。
所以说啊， 这20年真的是在斯大林的带领下， 把前苏联的经济带上了一个新高度。
虽然说哈，也有各种什么政治迫害、 大清洗，但是呢， 光从经济的角度上来说， 还是效果罢群的。
这边呢，尝到了计划经济的甜头。
另一边呢， 二战啊，苏联的国际地位又 得到了极大的提升， 可谓形势是一片大好， 又经历了一段时期的高速增长。
不过慢慢的啊， 从60年代开始， 这个前苏联的经济结构 也越来越复杂， 经济发展也逐渐稳定， 那计划就不是那么好计划的了。
你说 要没有市场这个无形的手在那调控 他，再厉害的政府 也不可能说 哪哪的经济 都给你计划的那么井井有条， 更何况啊高度集权的这种计划经济。
他还有一个问题， 就他一般情况下都是领导指哪打哪， 这就导致了前苏联政府的贪腐呀 也日益严重， 企业的创新就会严重受损。
前苏联就陷入了停滞时期。
`
  },
  {
    text: `除非是一场巨大的危机， 不然的话 你根本没有办法去解释 此刻的股神巴菲特， 他到底在等待些什么。
美国银行， 这是一家在西方世界， 甚至说全球金融行业里 都非常有声望、 位高权重的超级巨头。
巴菲特则是从2011年开始 对这家公司进行了大手笔的投资。
13年时间过去， 他一路买入， 从不卖出， 甚至说一口气把自己1/10的仓位 都压在了美国银行的身上。
几乎所有人都觉得 美国的标志性金融大佬 买入美国标志性的金融巨头 这笔买卖天作之合。
但是94岁的巴菲特 却把所有人都打了一个措手不及， 此时此刻， 他在狂卖美银。
根据美国SEC官方披露啊， 光是在9月的4号、5号 还有6号这三天， 他就卖出了1870 是4万股的美国银行。
而如果要把时间拉得更长一些的话， 那么从今年的7月份开始， 巴菲特就已经从美银的身上 套现了将近70亿的美元。
什么概念？
500亿的人民币。
这笔钱对于巴菲特巴老爷子来说 也许不算太多， 但你要知道， 上个月 他不计成本的抛售苹果公司， 就已经把全球金融市场吓死 魂飞魄散。
当时啊，他在毫无征兆 没有任何预告的情况下， 直接把苹果的仓位砍掉了50%。
说真的，在我们金融行业当中啊， 甭管你干了多久， 也没有人见过这样的场。
甚至就连美国的华尔街 现在也纷纷开始了议论， 说抛售苹果 还有美英这样的常见股票， 根本就不是巴菲特的风格。
看到这你肯定会以为啊， 这是他年事已高退出江湖的 前兆。就像是曾经的地主一样， 每到过年就要颗粒归仓， 清算一波自己的家底。
但你知道吗？
在过去的2023年， 巴菲特依靠投资定数了6900个亿， 而且还在年初正式的宣布了接班人， 规划之清晰， 战略之稳定， 看不见任何散场的。
而同时呢， 全世界的金融机构、 各大投行的交易员 又眼睁睁的啊 看着他手里的现金累的跟山一样高。
截止到目前 已经有差不多3000亿的。
哪怕你再不关心经济， 也应该思考了， 巴菲特现在到底在等待什么？
上一次 他手里持有如此高比例的现金， 还得回忆到2005年。
而在之后的没多久， 美国就爆发了次贷危机， 他顺势抄了一波大底。
夕阳之所以耀眼， 是因为牺牲了整个白天 所有的光芒。
而94岁的巴菲特， 此刻完全有可能啊， 正在屏息等待， 准备挥出他光荣山崖里最后一棒！
`
  },
  {
    text: `这个菲律宾怎么回事啊？
双倍差战，五渣， 回回碰瓷， 次次灰头土脸， 这有完没完啊， 这人啊，那么好了， 这货到底是个什么样的国家？
这么做图什么？
谁在背后给他撑腰？
今天我们从经济的角度 来给大家讲讲菲律宾， 三个词来概括一下菲律宾， 那就是美国舔狗、 寡头经济和菲佣帝国 对美国爱的深沉。
一度甘当美国殖民地， 不想独立， 甚至想加入美国成为人家一个州， 奈何美上百个门阀家族轮流坐庄， 把持政权， 断经济， 把曾经的亚洲第二富国祸祸 成了亚洲最穷的国家之一。
而另外支棱起菲律宾经济的 不是什么高科技、工业、 金融业， 而是遍布全球的雇佣和劳工。
总之横看竖看就是有点挫呀， 人是怎么变成今天这个样子呢？
简单来说呢， 就是先天条件一般， 还总想走捷径 哈哈哈。这个国家，从地图上来看啊， 挺有意思的， 由7000多个岛来组成 七零八落， 很难大规模连成片的发展， 于是很长时间呢， 人家都没有建成统一的国家， 而是各个岛上的家族部落啊， 各管各的。
直到16世纪啊，迈之伦转悠到这了， 带着西班牙殖民者 征服了这，菲律宾呢， 才正式建了国。
接着人又相继被美国殖民 日本占领， 再被美国收回， 而那些岛上的大家族啊， 也成了殖民代理人。
那这个过程啊， 美国的影响是最大的。
人，一边在这搞建设、 搞教育，让菲律宾 成了亚洲最早 走上工业化道路的国家之一。
一边呢， 又残酷的镇压菲律宾的民族主义， 扶持清美势力。
那结果 就是，菲律宾的经济是发展起来了， 可是完全依赖美国。
而看似有了国家政权， 其实硬骨头几乎都被打没了。
那情况有多夸张啊？
1929年美国经济大萧条， 没精力管菲律宾了， 想甩手啊， 让人独立得了， 这菲律宾人反而不干了， 说怎么的， 霍霍够我了， 翻脸不认人了是吧？
想分手啊， 没那么容易。
于是两边各种谈条件 扯皮，直到1934年才谈妥了。
美国接着扶持菲律宾， 10年之后再让菲律宾独立。
后来呢， 人民意义上确实也是独立了， 但是加入美国的心啊， 他一直没死。
上世纪60年代， 就有菲律宾的国会议员呢， 就发起入美运动， 要让菲律宾加入美国， 甚至呢，还说可以靠人多优势啊， 选菲律宾人当美国总统。
而这类运动啊， 断断续续到现在都还有， 那场面 大概就是美国，我叫你一声爸爸， 你敢应吗？
可美国呢？
大家看到了啊， 看到了是他主动啊， 跟我没关系啊。
其实1946年独立之后的菲律宾啊， 经济情况一度非常好， 工业基础 是完全继承美国殖民时期的遗产， 经济贸易呢 也几乎完全适合美国的单边贸易。
而50年代之后， 朝鲜战争和越南战争先后爆发， 菲律宾凭借地理优势啊， 拿下了大量的美军订单， 这生意红火呀， 这也让菲律宾的经济坐上了火箭。
1960年，菲律宾GDP啊，是排全球第20。
>而放眼亚洲， 除了日本几乎没有对手， 而人均GDP 甚至一度都是我们的3倍之多。
人家首都马尼拉 人送外号是亚洲小纽约， 甚至一度有机构预测说， 50年之后， 菲律宾将会成为世界第十大强国。
换句话来说， 人能跟法国、 意大利这种老牌资本主义国家 坐在一张桌子上吃饭， 好家伙呀！
啊！那现在我们听起来 感觉跟科幻故事一样， 因为不用50年， 你看看现在 人已经凉透了。
全亚洲最穷的国家之一， 泰国、马来西亚都能甩他几条街。
为什么会变成这样呢？
就是因为菲律宾大家族门阀遍地， 菲律宾从被殖民到老大 不乐意的独立， 这就相当于什么呀， 殖民的走了， 世家大族们呢， 继续接力统治。
比如在1987年的菲律宾国会， 总共200个众议员， 其中有130个是来自于大家族的， 另外还有39个呢， 跟大家族还是沾亲带故的。
这些家族门阀呀， 各种资源在手， 那还不利用特许经营权、 垄断权、 免税权等等这种各种特权大捞特捞， 奉旨发财呀。
而一马当先呢， 就是菲律宾现任总统 小马克斯的老爸 老马克斯， 这也是菲律宾的前总统。
这位老马的形式风格 就是从政界到商界 都塞满了自己人。
在菲律宾的任何生意 都要先给老马家族10%的好， 而所以人送外号10%先生。
最终 这个老马因为做的实在太过分的， 吃相太难堪了， 把其他大家族都得罪光了， 不得不带着上百亿美元资产 逃到了美国。
而留下的菲律宾呢， 已经成了 外债高达265亿美元的穷光蛋国家。
为什么会这样？
因为相比贪腐家族门法，垄断经济 最要命的问题是让菲律宾走上了趣 工业化的， 把美国留的家底都给败光了。
毕竟啊，你想啊， 只要垄断必需品 他就能躺着赚， 干嘛还要搞什么苦哈哈的 什么制造业高科技啊。
所以你就会发现， 菲律宾的工业化进程 在上世纪60年代之后就卡死不动了。
同样是和美国经济关系密切的日韩， 累死累活先从做衣服、做鞋子干起， 积累资本， 然后产业升级 发展高精尖的时候， 菲律宾反而从亚洲第二大工业国， 慢慢 先是被新马泰这样的邻居给超越， 接着又倒退成了农业国。
然后呢，又随着全球贸易自由化， 叠加了拉美危机、 亚洲金融危机 等等几波全球经济动荡的冲击， 菲律宾那是全面溃败啊。
低端制造业丧失竞争力， 高端制造完全没升级。
看来看去， 最后 人家只能搞搞轻松好赚钱的服务业。
2015年的菲律宾的农业和工业 占GDP的份额 分别从1980年代超过20%和40， 掉到了只有10%和33%。
而由于去工业化太早了， 就算是人家搞服务业， 也搞不出什么高附加值的服务业， 基本上只能搞搞旅游啊、 休闲等等低端服务。
这就是今天我们看到菲律宾的样子。
2022年菲律宾的GDP总量是4000亿美元出头， 什么概念呢？
还没咱们中国的一个零头高， 而人均收入是在1200-1800人民币左右， 这是亚洲最穷的国家之一， 同时呢，贫富差距特别巨大。
如果说你站在今天的菲律宾首都 马尼拉的市中心里面， 就会觉得，哎， 跟咱们北上广好像没什么两样， 高楼林立， 车水马龙， 房价也得四五万一平往上走， 而一街之隔的是一座座垃圾山 以及上百万人居住的贫民窟。
这贫民窟啊， 几千块钱 就可以买走一个女孩做老婆。
大家把从垃圾堆里面 捡来的吃的东西 洗一洗，重新加热 就成了。菲律宾的特产 叫派派。这叫什么呀？
富者田连阡陌， 贫者无立锥之地。
而因为工业、农业拉垮人， 服务业又没有办法提供大量的就业， 大量普通菲律宾人呢， 想混口饭吃就只能出国打工。
这又诞生了菲律宾的另一个奇观。
因为早年美国人的介入管理啊， 菲律宾人的英语都不错啊， 服务意识也很强， 直接就把菲佣 干成了菲律宾的支柱产业之一。
光去年菲律宾的海外劳工 就赚了372亿美元的外汇， 这占到了人家经济总量的8.5%， 这个比例什么概念？
去年中国汽车超越了房地产， 成了中国经济第一支柱， 占的比例也就差不多10%啊， 这就是目前菲律宾的经济现状。
所以你就能够理解， 为什么每当全球经济环境下，行 人不会去努力奋斗扭转国运， 而是习惯性靠走捷径来解决问题。
比如频频碰瓷东方大国， 试图向自己精神上的父亲那投名状。
那为什么 人连像样的大船都造不出来， 每次碰瓷还都是小破渔船出卖。
用今天的话说， 这纯纯的又菜又爱闹。
可用2000年前的韩非的总结 则是，国小而不储卑， 利少而不畏强， 无礼而武大林， 贪鄙而拙骄。`
  },
  {
    text: `娃哈哈又一次站上风口浪尖了。
这次是接班人发生变化了。
刚刚去世没多久， 也就是娃哈哈创始人钟老的女儿 宋富丽 突然公开提交了一份辞职信。
信的内容。大概我们总结一下啊， 就是我爸去世以后， 娃哈哈部分股东就质疑， 由我来接班掌管娃哈哈是不合理的， 这活我干不下去了， 所以 我要辞去副董事长和总经理的职。
这事一出， 问题很多的小明就表示说，哎呦， 有那味了， 先帝驾崩， 老臣和新王 有些能相辅相成， 有些却是有你陪我呀。
哈哈哈，假人呐。
不光是这样， 娃哈哈 远远没有女神副业这么简单呢。
你得知道这公司的真正老板是谁？
股东都是谁啊？
娃哈哈 它并不是一家纯粹的民营企业， 它是一家国企改制而来的 混合所有制企业。
简单来讲， 那就是既是有国有股东 也有民营股。
怎么回事呢？
这公司 不是宗老个人直接创立的企业， 当年前身 是 浙江杭州上城区的一家校办企业 的经销部， 算是地方国资企业吧。
宗老当时是那公司里面的员工啊。
在1987年，42岁的宗庆后呢， 是以职工的身份 承包了这家校办企业， 获得了完全独立的经营权。
后来呢，给这企业再取名为娃哈哈。
接着，大家都知道了， 做大做强， 再创辉煌， 一步一步 把这家曾经经营困难的校办企业 办成了全国V百强。
对娃哈哈有再造之功的宗老啊， 他的身份既不是娃哈哈的老板， 其当年手上也没有一丁点的股份， 毕竟啊，只是承包嘛， 说白了这公司又不是你的。
而这个转变呢， 就是在2000年， 在那一年， 娃哈哈完成了改制， 也就是这家国资企业决定啊， 让出一部分股东给员工， 大家伙，哥几个量力掏钱买股份， 为的就是什么， 大家都当股东， 那可不就更能激发干劲了吗？
宗庆后自然是首当其冲。
而之后 哇哈哈的股权就一分为三了， 国资占一部分， 中金后自己占一部分， 然后员工又占一部分。
那现在最新的股东结构是什么呀？
杭州国资委占股百分之46， 宗亲后占股29.4%， 员工占股24.6%。
这看上去好像这终老股份不多 还不到30%， 可是员工们跟他几乎是一条心啊啊， 几十年风雨同舟， 那是一致行动人， 这两边加一块 占股有54%。
所以说 当年宗庆后虽然不是大股东， 但却始终是哇哈的实际控制， 看上去一切是不是都挺完美的呀？
啊，但实际上也有隐患， 创一代的强人治理跟人格魅力 在去世之后往往会留下真空。
说白了，对于那老员工来说， 当年我认你， 宗庆后，我跟你， 我服你，但是你走了， 你家孩子那就另错了。
一方面呢， 是啊，宗老去世之后， 这宗复利 还没有正式继承 宗老在娃哈哈的股份， 他的身份也一直是副董事长、总经理。
接管娃哈哈 暂时从法律上来讲 还没有依据， 而且哪怕他后面继承了， 还得获得员工持股会的认可 以及国资股东的批准， 但这不重要啊。
另一方面， 东富力进入到这， 哇哈哈，仿佛感觉跟这家公司啊， 他有代沟啊， 而且在处理跟老员工的关系上呢， 似乎也一直是他的短板。
你看这小 宗什么学历啊， 海外留学归来， 性格跟作风呢， 相对来讲更加直接。
而宗老是什么？
为人更加传统， 更加讲究人情。
我举几个例子啊， 比如宗老曾经就表态说， 咱们娃哈哈呀， 不缺钱，没有上市的必要。
而宗富利呢， 却公开唱反调 说娃哈哈要上市很正常， 只有跟资本市场结合才能走的更远。
再比如啊， 宗富利对内是铁腕管理啊， 如果说你没有完成任务， 可以直接开除， 丝毫不讲情面， 我管你是不是老员工， 而宗老呢， 讲究的是用人质、 聚人心，甚至呢， 还会再偷偷的把这些老员工啊 再请回来。
但是你要是从商业 或者说管理层面单独来讲， 你很难就说 这小宗做的就一定有问题， 老宗就做的一定没毛病， 而这问题的核心其实是什么呀？
娃哈哈，如果说是你宗馥利创立的， 那就是你宗馥利做的对。
而更重要的一点， 那就是在经营的业绩层。
这小宗早年呢， 做了一系列的尝试， 效果只能说是一般般。
21年底，这小宗宗富力 升任娃哈哈的副董事长兼总经理， 同时宣布推出了20多款新品。
可结果呢？
整个22年呢， 娃哈哈的总营收是512亿， 比21年还下跌了7个亿。
这是什么呀？
一顿操作猛于虎， 一看还在原地杵啊！
你不能说综合力不努力， 抬头看看全球这几年大环境， 你说他真的是有点生不逢时吧？
虽然不算准确， 但也有点影响， 但只不过出了问题 就一定需要有人去负责。
老宗在的时候， 也许可以给小宗不断试错的机会， 而那些开朝老臣们呢， 就算有点想法，也不方便明着撕破脸， 而现在 谁还能站在小宗身后来给他善后？
>当然了，无论如何啊， 都希望娃哈哈这个民族品牌 能够好好的， 毕竟啊，那是包括我在内 几代人童年的回忆啊！`
  },
  {
    text: `你敢信吗？
特朗普给国货来了一波实力带货。
上个月啊， 特朗普跟马斯克 可以说是俩全球顶流的男人 连线直播， 结果有眼见的网友就发现说，哎， 特朗普手机下面垫的这个充电宝 好像是中国品牌安克的， 你看看，工作归工作， 这个MADE in China才是生活。
就这么个小小的细节啊， 让安克的股价在被发现的一瞬间 就跳涨了3%。
安克的客服都说了， 好多人都来咨询这个充电宝， 安克也非常机智的 在这个产品描述里 加上了一个懂王同款。
>不得不说啊， 特朗普这个带货实力确实不一般。
安克这个品牌啊， 可以说是一个隐藏的巨头， 别看它就是卖卖充电宝啊、 充电线这些小配件， 但它 在中国全球化品牌50强的榜单里边 能排到第16， 仅次于亚迪， 绝对属于那种低调的行业隐形冠军。
安克是2011年 由一个前谷歌工程师杨萌成立的， 那时候 深圳华强北正好有一波出海潮， 国内市场太卷， 加上阳萌又有海外背景， 所以他第一步就另辟蹊径， 选择跳过国内市场， 直接冲击海外。
想利用中国的供应链去打海外市场， 这个思路 我们现在可能感觉习以为常了， 但放在当时 还是挺大胆的。
而这招专攻海外， 也直接让安克抱上了两条大腿， 这第一条大腿就是苹果。
2011年左右， 正好是智能手机加速普及， 但这个官方的配件吧， 大家都懂， 太贵了。它大部分平替的配件呢， 倒是便宜， 但质量就一般般。
哎，安克他就瞄准了这个市场， 专门给苹果做高质量的 配件。
他很聪明的一点哈， 就是他会盯着iPhone去宣传， 紧跟着苹果蹭流量。
iPhone在哪打广告， 或者有人在哪搜iPhone相关的关键词， 哎，安克就把广告打在哪， 你前脚刚看完iPhone， 后脚安克就弹出来了。
感兴趣iPhone手机， 我这有配件， 还物美价廉。
当然哈，安克这产品确实不错， 颜值也很高， 慢慢呢就拿下了一批苹果用户， 而他的第二条大腿就是亚马逊。
安克在非常早期就入驻了亚马逊， 当时亚马逊的排序机制 主要就是看销量和评价。
安克呢， 就把广告都导到亚马逊去成交， 积累了非常好的销售数据， 同时用户也很满意， 很快就成为了亚马逊 消费电子里的王牌卖家。
同类产品里， 它的市场份额可以达到30%。
而后来到2020年的时候， 又吹来两股风， 让安克直接起飞。
一个就是 疫情，让美国人也开始习惯网购了， 线上购物的需求大大增加， 这就让非常擅长线上营销的安克销量跟着大涨。
而另一股风呢？
哎，还是苹果， 苹果不是从iPhone 12开始 就不送充电器了吗？
这就让他把一部分业务 拱手又让给了安克， 这也让安克即使这两年 还能实现百分之三四十的增长， 成为了 可以说是配件品牌出海的标杆。
所以你看最近这几年 品牌出海已经不光是汽车啊、手机啊、 家电这些大品牌的趋势， 类似安克这种细分领域的自主品牌、 新兴品牌 也掀起了国货出海的一股浪潮。
前两天我去上海，那外滩大会 就看到了非常多新奇的中国 出海好货， 有那种自主设计师设计的鞋呀、 衣服呀、椅子这种日常消费品， 还有很多非常新颖的， 像智能猫砂盆啊， 纸牌屋同款的划船机啊， 超轻钛合金的伊拜克 三防固态硬盘等等， 这些 其实都是比较细分领域的行业冠军， 不管是从技术质量 还是那个设计的精致度， 你看完感觉还真挺震撼。
到现在啊， 在亚马逊的美、英、日、法等等站点， 中国卖家的比例都已经超过了50%。
同时呢， 这些出海的品牌也更注重本土化、 多元化和品牌化。
比如像安克 最开始是靠着亚马逊， 但慢慢也延伸到了阿里express、 ebay等等， 现在也开始有了自己的独立站， 同时在线下拓展渠道。
根据万里汇2024年上半年的数据啊， 在平台上改走品牌化道路的卖家 同比暴涨了138%， 他们也更注重 在本地区设立主体运营， 打通供应链等等。
你像这些品牌卖家， 他在出海的过程当中 经常会遇到一个问题， 其实就是金融上的， 比如说跨境支付啊， 外汇的收付啊等等， 所以就会有一些 这样的跨境金融管理工具， 比如蚂蚁旗下的万里汇， 假设你想把货卖到欧美、 东南亚等等等很多国家， 那你可能会需要，哎， 我亚马逊开一个，户 Lazada开一个， TikTok shop开一个， 然后每个平台都得单独认证， 什么美元、欧元、 印度卢比都得单独管理 是吧？当时就头大， 所以呢， 他们就会用万里汇这样一个账户， 链接130多个 涵盖了几乎所有 主流的跨境电商平台， 就可以在像亚马逊、shein、沃尔玛 TikTok等等的这些平台收付款， 还能一键完成平台的认证啊、 合规啊等等， 包括很多品牌独立站， 它也能支持全球200多个国家地区 30多个币种的收款， 还有近百种币种的付款。
而且哈，这个万里汇账户 它还是一个出海的资金管理中心。
怎么讲呢， 你像理财贷款， 还有一些外汇的避险工具， 包括应急的资金周转等等， 这些金融功能也有。
就好像有一个非常懂出海的CFO 给你提供金融支持， 包括资源对接， 这样卖家就可以专注在把货给做好、 卖好， 让这些出海的国货可以走的更稳。`
  },
  {
    text: `哪个国家 印出了这张100万亿元的钞票？
我跟你说， 他的通货膨胀可以说是世界闻名， 从2000年开始 通胀就没下过三位数， 而伴随着这个恶性通胀的 其实就是金元对美元的急速贬值。
98年的时候， 一美元还能兑24津巴布韦元， 到06年就贬值到1美元兑10万金元。
这津巴布韦政府一看， 对吧？这0也太多了， 干脆咱就抹掉3个0， 定义一个新的津巴布韦元 叫ZWN啊， 他原来那个货币叫ZWD， 这样一美元就兑100金元了， 对吧？你看 多聪明。结果 津巴布韦这边 没止住恶性的通货膨胀， 这金元贬值的速度就越来越快。
一年后，07年4月的时候 又跌到了一美元兑3万津巴布韦元， 年底的时候 又变成一美元兑200万金元， 之后每个月都在狂泻， 半年之后 就出现了那张5000亿金元的钞票。
津巴布韦政府一看， 这0又太多了 对吧？老办法 再抹0，这次直接抹掉10个0， 就是除以100亿， 然后这新的货币呢， 就叫做DWR。
好吧，这个时候啊， 津巴布韦通过膨胀 据估算已经飙升到了 百分之九乘以10的22次方， 那外汇市场可想而知。
到半年之后， 就09年初的时候， 它又印出来那张举世闻名的 100万亿金元的钞票。
不过你看着这么多万亿， 最后其实也就值不到0.4美元， 那央行说好 咱再去要12个0 再除以1万亿啊， 这个新的货币就叫ZWL。
你看，短短三年里， 津巴布韦政府已经砍掉了25个零， 到最后这金元已经完全没有信用了。
你想你这政府整天这么砍零，然 后推出新货币， 到最后可能这26个字母都不够你用。
无奈之下， 政府被迫放弃金鱼，哎， 用欧元美元， 这才止住了国内的恶性膨胀。
不过最近哈，刚缓过来， 1.19年的时候， 津巴布韦又火奋起来， 推出了自己的货币， 通胀又飙到三位数。
然后今年4月份， 他就又又又推出自己新货币， 叫ZWG津巴布韦金， 这回号称是有贵金属倍数， 你就说这津巴布韦它乱不乱？
通过这个极端的例子啊， 你其实非常容易看出来， 通货膨胀跟外汇之间的关系。
物价，它对汇率的影响最底层， 但同时 也可能会非常的缓慢的隐形。
所以你如果一般看 那种比较主流的货币啊， 就比如说美元 过去50年通过膨胀跟汇率的对比， 只有80年代美国高速通胀的时期， 你才能非常明显的看到富相关。
从90年代之后 就没有什么特别明显的相关性， 这为什么啊？
就是因为像美元、欧元、日元， 包括人民币， 他大部分的时间通胀都是在10%以下， 这个区间叫轻微的波动。
你要不是放到像什么津巴布韦、 委内瑞拉、 土耳其这种 通胀一下就飙到超过50%的 这些国家， 一般看起来啊 可能都不会那么明显。`
  },
  {
    text: `国产芯片终于迎来重大突破了。
说两个好消息， 第一， 国产光刻机已经开始量产推广了。
这是工信部公开的数据， 差不多相当于阿斯麦公司的1460K， 可以生产65纳米级别的芯片。
虽然制程不是很先进， 但是它的重要意义 在于核心零部件国产化 被西方卡脖子。
用官方的话术来说， 这是事关综合国力 和国家安全的国之重器。
到今天，全国上下 其实都已经达成了一项共识， 就是 我们不能再对外资抱有任何幻想。
芯片产业链国产化势在必行。
当然，要实现这么宏大的目标， 不仅需要国家支持， 更需要企业参与。
这里就要讲到第二个好消息了， 2024年9月20日， 由长城汽车牵头 联合开发的车规级MCU芯片紫金M100 已经全部完成并成功点亮。
光看这条消息， 很多人可能体会不到 这颗芯片的重要意义。
说几个数据吧， 2023年，中国新能源汽车产量 达到了958.7万辆， 然而 我们的汽车芯片自给率却不到10%。
这其中像IGBT这类功率芯片 国产率大概有35%， 但像紫金M100这种 难度更大的MCU芯片 自给率却只有10%。
这就意味着 中国的汽车芯片市场 绝大部分营收和利润 都被外国企业拿走了。
而且我们的汽车产业发展 也会随时受到外人的限制。
比如2021年 西方国家的供应链危机 引发了一轮芯片荒， 导致中国汽车减产了198.2万辆。
所以长城这颗国产自研的紫荆M100 不仅是国内芯片产业链的重大突破， 也是中国汽车产业打破垄断、 实现芯片自由 的关键一步。
更重要的是， 这颗芯片的国产化程度非常高， 从硅知识产权的获取 到精源制造、封装测试 各个核心环节都在国内完成， 这样就能大幅度降低 被国外卡脖子的风险。
而且这还只是个开始。
这次公布的紫荆M100 会首先应用在X55大灯控制器平台， 计划5年上车量不低于250万辆， 今后 还会拓展到空调抬头显示等等模块。
未来还会推出紫荆M200和M300系列， 主要应用在动力、底盘系统， 甚至 还包括汽车最核心的中央处理器 紫荆S300等。
到长城汽车完成了这套芯片矩阵， 再加上智能驾驶方面 开启全国体验的长城全场景。NOA， 在智能座舱领域相当亮眼 的coffee OS3的全新升级， 这足以让它在智能化时代的竞争中 立于不败之地。
事实上，长城在这些技术上的投入 已经获得了非常不错的回报。
比如说今年9月上旬， 全新魏牌阑珊在6座7座SUV排行榜中 以1741辆的销量拿下周榜。
还有长城汽车 今年的季度盈利和营收 双双超过预期， 直接带动最近的长城股价大幅上涨。
这就告诉我们一个道理， 国内车企必须死磕技术， 为消费者带来好产品， 才能获得更好的业绩 和更长远的发展。
这次推出的芯片和光刻机 可能不是行业里最先进的， 也不能一步到位完全取代西方技术。
我们需要正视差距， 尊重事实。
我们也需要更多的企业像长城一样， 勇于踏出自主研发的第一步。`
  },
  {
    text: `当然了，除了俄罗斯之外，其他国家也在买中国汽车，比如墨西哥。 2013 年，墨西哥所有销售汽车中有 25% 来自中国，而在 6 年前这个数字为0。澳大利亚也在不断买中国汽车，最受澳大利亚欢迎的中国汽车品牌是名爵，去年卖了 5.8 万辆。在新能源车市场，比亚迪则占据了澳大利亚的新能源汽车 14% 份额，位于第二名。当然，这里也不得不提一下第一名，那就是特斯拉市场份额高达53%，在东南亚市场，中国车企业销量在 2013 年同样实现小幅上升，最典型的就是泰国，在泰国的新能源车市场，中国品牌占据了 80% 的份额，比如比亚迪的原 plus 就是泰国的新能源车爆款，那到底是什么原因让中国汽车爆卖呢？基本还可以总结为三方面原因，首先是全球疫情爆发，由于中国汽车的供应链完善，疫情期间仍能维持稳定生产，而日韩这些过去的出口大户受疫情影响，芯片、钢材、橡胶等关键原材料短缺，不仅汽车产能下降，而且成本升高，这就让中国汽车更具性价比。而随着中国国内新能源汽车市场越来越卷出海，成为不少中国车企的选择，比如比亚迪 2023 年进入全球 58 个国家和地区，出口汽车 24 万辆，是上一年度的 3.34 倍。在泰国新能源车市场，比亚迪单独占到了 40% 的市场份额，是名副其实的泰国新能源汽车销冠。而且中国新能源汽车并非只是具备成本优势，汽车与 AI 互联网融合的智能化更是中国车企的拿手好戏。从豪华配置到智能大屏，从外观设计到内饰比拼，这让中国新能源汽车的溢价能力明显变高。2019 年中国新能源汽车平均出口价格每量只有 5, 000 美元， 2022 年涨到了 2.2 万美元。比如比亚迪汉在欧洲发布时价格接近 50 万人民币，是国内售价的两倍多。在泰国、以色列、新西兰等多个国家，比亚迪也已经是新能源汽车的销售冠军。不过，中国汽车征服海外虽然是一部励志爽门，但其实有不少挑战。`
  }
];
